# groupby
참고 링크 : https://nittaku.tistory.com/131  
groupby() 함수의 절차를 split - apply - combine 이라고 한다.  
기준열을 지정하여 특정열을 그룹별로 나누고 - 각 그룹에 통계함수를 적용하고 - 최종적인 통계량이 산출된 것을 통합해서 표시해주기 때문이다. 통계량을 구하려고 하는 것이므로 groupby를 사용하면 반드시 통계함수를 적용해야 한다.

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.672391 -0.982276
1    a  two -1.796383  0.014492
2    b  one  0.915587  2.126393
3    b  two  0.788594 -0.791110
4    a  one  0.671202 -1.030870

key1열이 a인 행들에 대해 data1의 평균을 구하고 싶다고 하자

방법1

In [4]:
df.groupby('key1').data1.mean()

key1
a   -0.150930
b    0.852091
Name: data1, dtype: float64

방법2

In [8]:
df['data1'].groupby(df['key1']).mean()

key1
a   -0.150930
b    0.852091
Name: data1, dtype: float64

기준 열을 2개 이상 지정하기

In [9]:
df

  key1 key2     data1     data2
0    a  one  0.672391 -0.982276
1    a  two -1.796383  0.014492
2    b  one  0.915587  2.126393
3    b  two  0.788594 -0.791110
4    a  one  0.671202 -1.030870

unstack()함수를 적용해서 최하위 인데스를 칼럼으로 올린 뒤 데이터를 분석해도 된다.

방법1

In [10]:
df.groupby(['key1','key2']).data1.mean()

key1  key2
a     one     0.671796
      two    -1.796383
b     one     0.915587
      two     0.788594
Name: data1, dtype: float64

In [13]:
df.groupby(['key1','key2']).data1.mean().unstack()

key2       one       two
key1
a     0.671796 -1.796383
b     0.915587  0.788594

방법2

In [11]:
df['data1'].groupby([df['key1'],df['key2']]).mean()

key1  key2
a     one     0.671796
      two    -1.796383
b     one     0.915587
      two     0.788594
Name: data1, dtype: float64

In [12]:
df['data1'].groupby([df['key1'],df['key2']]).mean().unstack()

key2       one       two
key1
a     0.671796 -1.796383
b     0.915587  0.788594

DataFrame에 groupby 사용하기 : df의 모든 열에 대해서 통계량이 계산된다.

In [14]:
df

  key1 key2     data1     data2
0    a  one  0.672391 -0.982276
1    a  two -1.796383  0.014492
2    b  one  0.915587  2.126393
3    b  two  0.788594 -0.791110
4    a  one  0.671202 -1.030870

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.150930 -0.666218
b     0.852091  0.667641

count : 각 key1열의 값을 가지는 행들의 갯수를 세서 산출해 준다.

In [16]:
df

  key1 key2     data1     data2
0    a  one  0.672391 -0.982276
1    a  two -1.796383  0.014492
2    b  one  0.915587  2.126393
3    b  two  0.788594 -0.791110
4    a  one  0.671202 -1.030870

In [17]:
df.groupby('key1').count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2